/* eslint-disable prettier/prettier */
import * as React from "react"
import IconInterface from "interfaces/components/IconInterface"

function IconNotificationList({ width, height }: IconInterface) {
  return (
    <svg
      id="IconNotificationList"
      xmlns="http://www.w3.org/2000/svg"
      width={!width && "214"}
      height={!height && "214"}
      viewBox="0 0 214 214"
    >
      <path
        id="Trazado_5386"
        data-name="Trazado 5386"
        d="M1654.593,652.562a1.17,1.17,0,0,0-1.656,0l-3.921,3.921-3.921-3.921a1.17,1.17,0,0,0-1.655,1.655l3.921,3.921-3.921,3.921a1.171,1.171,0,1,0,1.655,1.656l3.921-3.921,3.921,3.921a1.171,1.171,0,0,0,1.656-1.656l-3.921-3.921,3.921-3.921A1.17,1.17,0,0,0,1654.593,652.562Z"
        transform="translate(-1483.016 -571.558)"
        fill="#70777c"
      />
      <circle
        id="Elipse_1425"
        data-name="Elipse 1425"
        cx="107"
        cy="107"
        r="107"
        fill="#f4f5fb"
        opacity="0.27"
      />
      <circle
        id="Elipse_1426"
        data-name="Elipse 1426"
        cx="93"
        cy="93"
        r="93"
        transform="translate(14 14)"
        fill="#f4f5fb"
      />
      <g
        id="Elipse_1427"
        data-name="Elipse 1427"
        transform="translate(82.5 38.021)"
        fill="none"
        stroke="#707070"
        strokeWidth="2"
      >
        <circle cx="5" cy="5" r="5" stroke="none" />
        <circle cx="5" cy="5" r="4" fill="none" />
      </g>
      <g
        id="Elipse_1428"
        data-name="Elipse 1428"
        transform="translate(150.5 97)"
        fill="#70777c"
        stroke="#70777c"
        strokeWidth="1"
      >
        <circle cx="2.5" cy="2.5" r="2.5" stroke="none" />
        <circle cx="2.5" cy="2.5" r="2" fill="none" />
      </g>
      <g
        id="Elipse_1457"
        data-name="Elipse 1457"
        transform="translate(47.5 110)"
        fill="#70777c"
        stroke="#70777c"
        strokeWidth="1"
      >
        <circle cx="2.5" cy="2.5" r="2.5" stroke="none" />
        <circle cx="2.5" cy="2.5" r="2" fill="none" />
      </g>
      <g
        id="Grupo_11671"
        data-name="Grupo 11671"
        transform="translate(42 29.021)"
      >
        <path
          id="Trazado_6070"
          data-name="Trazado 6070"
          d="M64.551,139.478a12.174,12.174,0,0,1-8.575-3.566,5.607,5.607,0,0,1,4.006-9.531H70.16a5.607,5.607,0,0,1,4.029,9.52,12.183,12.183,0,0,1-8.586,3.577h0c-.174,0-.35,0-.525-.011s-.35.011-.526.011"
          fill="#fff"
        />
        <path
          id="Trazado_6071"
          data-name="Trazado 6071"
          d="M70.173,127.88a4.107,4.107,0,0,1,2.941,6.973,10.6,10.6,0,0,1-7.513,3.125c-.17,0-.34,0-.51-.013h-.029c-.171.008-.342.013-.512.013a10.592,10.592,0,0,1-7.511-3.125,4.107,4.107,0,0,1,2.941-6.973H70.173m0-3H59.993a7.107,7.107,0,0,0-5.1,12.067,13.7,13.7,0,0,0,9.659,4.031c.175,0,.351,0,.527-.011s.349.011.524.011a13.684,13.684,0,0,0,9.64-4.01,7.107,7.107,0,0,0-5.068-12.088"
          fill="#70777c"
        />
        <path
          id="Trazado_6072"
          data-name="Trazado 6072"
          d="M27.379,124.356a8.338,8.338,0,0,1-5.6-14.517l7.527-6.822a2.609,2.609,0,0,0,.851-1.928V77.737A34.962,34.962,0,0,1,37.02,56.393,32.537,32.537,0,0,1,55.213,44.7V42.483a9.5,9.5,0,0,1,9.48-9.091c.124,0,.249,0,.373.007s.249-.007.373-.007a9.483,9.483,0,0,1,9.47,8.994v2.281a32.471,32.471,0,0,1,18.209,11.7,35.026,35.026,0,0,1,6.84,21.39v23.32a2.613,2.613,0,0,0,.858,1.93l7.535,6.792a8.358,8.358,0,0,1-5.593,14.556Z"
          fill="#fff"
        />
        <path
          id="Trazado_6073"
          data-name="Trazado 6073"
          d="M65.439,34.892a7.991,7.991,0,0,1,7.973,7.572v3.414a30.977,30.977,0,0,1,18.522,11.41A33.321,33.321,0,0,1,98.46,77.73v23.348a4.1,4.1,0,0,0,1.35,3.043l7.538,6.793a6.832,6.832,0,0,1,2.254,5.068v.04a6.846,6.846,0,0,1-6.845,6.834H27.373a6.837,6.837,0,0,1-4.589-11.905l7.527-6.823a4.1,4.1,0,0,0,1.343-3.039V77.737a33.294,33.294,0,0,1,6.57-20.449A31.011,31.011,0,0,1,56.713,45.911V42.483a8,8,0,0,1,7.98-7.591c.124,0,.248,0,.373.009s.249-.009.373-.009m0-3c-.124,0-.249,0-.373.006s-.249-.006-.373-.006A10.987,10.987,0,0,0,53.717,42.33l0,.077v1.128A34.021,34.021,0,0,0,35.857,55.444l-.021.027-.02.027a36.492,36.492,0,0,0-7.162,22.265v23.326a1.1,1.1,0,0,1-.361.819l-7.524,6.82a9.837,9.837,0,0,0,6.6,17.128h75.373a9.859,9.859,0,0,0,6.612-17.169l-7.54-6.795a1.1,1.1,0,0,1-.358-.815V77.757A36.515,36.515,0,0,0,94.346,55.5l-.021-.028-.021-.028A33.978,33.978,0,0,0,76.412,43.5V42.386l0-.078A10.984,10.984,0,0,0,65.439,31.892"
          fill="#70777c"
        />
        <path
          id="Trazado_6074"
          data-name="Trazado 6074"
          d="M70.151,127.88H59.985a4.107,4.107,0,0,0-2.954,6.973,10.588,10.588,0,0,0,8.022,3.112h.03a10.592,10.592,0,0,0,8.022-3.112,4.107,4.107,0,0,0-2.954-6.973"
          fill="#fafafa"
        />
        <path
          id="Trazado_6075"
          data-name="Trazado 6075"
          d="M27.379,121.356a5.337,5.337,0,0,1-3.589-9.293l7.528-6.824a5.619,5.619,0,0,0,1.836-4.15V77.737a31.979,31.979,0,0,1,6.274-19.554q.262-.337.538-.67a50.58,50.58,0,0,0,65.661,53.869l.716.646a5.358,5.358,0,0,1-3.585,9.328Z"
          fill="#fafafa"
        />
        <path
          id="Trazado_6076"
          data-name="Trazado 6076"
          d="M38.146,63.031V63.2a52.081,52.081,0,0,0,67.111,49.869l.081.072a3.86,3.86,0,0,1-2.592,6.716H27.373a3.837,3.837,0,0,1-2.575-6.683l7.531-6.826a7.118,7.118,0,0,0,2.325-5.258v-23.4a30.465,30.465,0,0,1,3.492-14.653M42.2,53.072a31.011,31.011,0,0,0-3.974,4.215,33.3,33.3,0,0,0-6.569,20.45v23.352a4.1,4.1,0,0,1-1.343,3.039l-7.528,6.822a6.838,6.838,0,0,0,4.59,11.906h75.384a6.844,6.844,0,0,0,6.844-6.834v-.04a6.827,6.827,0,0,0-2.253-5.068l-1.363-1.229A49.1,49.1,0,0,1,42.2,53.072"
          fill="#fff"
        />
        <path
          id="Trazado_6077"
          data-name="Trazado 6077"
          d="M70.671,127.237H59.461a8.571,8.571,0,0,0-3.175.547c-1.551.643-1.781,1.643-.684,2.394H74.526a1.309,1.309,0,0,0,.688-1.02c-.008-1.064-2.042-1.924-4.543-1.921"
          fill="#70777c"
        />
        <path
          id="Trazado_6078"
          data-name="Trazado 6078"
          d="M74.872,48.943c0,1.223-4.389,3.576-9.8,3.576s-9.8-2.353-9.8-3.576,4.389-2.215,9.8-2.215,9.8.992,9.8,2.215"
          fill="#fafafa"
        />
        <path
          id="Trazado_6079"
          data-name="Trazado 6079"
          d="M72.687,45.563c0,2.343-3.411,4.242-7.619,4.242s-7.619-1.9-7.619-4.242,3.411-4.242,7.619-4.242,7.619,1.9,7.619,4.242"
          fill="#fff"
        />
        <line
          id="Línea_537"
          data-name="Línea 537"
          x2="12.822"
          y2="9.062"
          transform="translate(1.5 37.422)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <line
          id="Línea_538"
          data-name="Línea 538"
          x2="4.987"
          y2="3.525"
          transform="translate(19.551 50.18)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <line
          id="Línea_539"
          data-name="Línea 539"
          y1="11.102"
          x2="11.102"
          transform="translate(88.24 27.152)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <line
          id="Línea_540"
          data-name="Línea 540"
          y1="4.318"
          x2="4.318"
          transform="translate(103.871 18.307)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <line
          id="Línea_541"
          data-name="Línea 541"
          x2="9.321"
          y2="11.759"
          transform="translate(34.873 27.438)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <line
          id="Línea_542"
          data-name="Línea 542"
          x1="8.747"
          y2="6.31"
          transform="translate(105.619 52.957)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <line
          id="Línea_543"
          data-name="Línea 543"
          y2="20.408"
          transform="translate(65.068 1.5)"
          fill="none"
          stroke="#70777c"
          strokeLinecap="round"
          strokeWidth="3"
        />
        <rect
          id="Rectángulo_4640"
          data-name="Rectángulo 4640"
          width="115.867"
          height="140.978"
          fill="none"
        />
      </g>
    </svg>
  )
}

export default IconNotificationList
